# UIApplication Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIApplication Constructor
UIApplication Class See Also
---
Use a database level Application to construct a UI-level Application.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public UIApplication(
	Application revitApp
)
```

Visual Basic
---
```text
Public Sub New ( _
	revitApp As Application _
)
```

Visual C++
---
```text
public:
UIApplication(
	Application^ revitApp
)
```

# ### Parameters
revitApp
    Type: Autodesk.Revit.ApplicationServices..::..Application
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the Application argument is a null pointer. |

# See Also
UIApplication Class
Autodesk.Revit.UI Namespace